sdaiRemoveByIndex(Sdai_Id_aggr*,System.UInt32)
\details
Removes a list element specified with an index value.
\param list  [in] An application instance list.
\param index [in] An index value that defines the positionn of an element to remove.